003_flowAroundCylinder/buoyantPimpleFoam_k-megaSST/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          0.0001;

writeControl    adjustable;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  on;//no;

maxCo           0.9;

functions
{
    #includeFunc solverInfo
    #includeFunc fieldMinMax
    #includeFunc yPlus
    
    #include "continuityErrorVolDict"
    #include "forceCoeffs" 
    #include "probes"

    #include "patchProbes"
    #include "pressureCoefficient"
	#include "heatWall"

}

// ************************************************************************* //
