003_flowAroundCylinder/buoyantPimpleFoam_k-megaSST/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [ 0 1 -1 0 0 0 0 ];
internalField    uniform (0.15 0 0);
boundaryField
{
    Xmin
    {
        type            fixedValue;
        value           $internalField;
    }

    Xmax
    {
        type            zeroGradient;
    }

    "(Ymin|Ymax)"
    {
        type            slip;
    }

    hole
    {
        type            noSlip;
    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
