003_flowAroundCylinder/buoyantPimpleFoam_k-megaSST/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    Xmin
    {
        type            zeroGradient;
    }

    Xmax
    {
        // type            fixedValue;
        // value           $internalField;
    	// type    fixedFluxPressure;
		// value    uniform 1e5;
		type    totalPressure;
		U    U;
		phi    phi;
		psi    none;
		gamma    1;
		rho    rho;
		p0    uniform 1e5;
    }

    "(Ymin|Ymax)"
    {
        type            slip;
    }

    hole
    {
        //type            zeroGradient;
        type    fixedFluxPressure;
		value    uniform 1e5;
    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
