003_flowAroundCylinder/buoyantPimpleFoam_k-megaSST/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.38E-06;

boundaryField
{
    Xmin
    {
      type    turbulentIntensityKineticEnergyInlet;
      intensity    0.01;
      value    $internalField;
    }

    Xmax
    {
      type    inletOutlet;
      inletValue    $internalField;
      value    $internalField;
    }

    "(Ymin|Ymax)"
    {
        type            slip;
    }

    hole
    {
		type    kqRWallFunction;
		value    $internalField;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
