003_flowAroundCylinder/buoyantPimpleFoam_k-megaSST/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Xmin
    {
		type    calculated;
		value    uniform 0;
    }

    Xmax
    {
		type    calculated;
		value    uniform 0;
    }

    "(Ymin|Ymax)"
    {
        type            slip;
    }

    hole
    {
		type    nutkWallFunction;
		value    uniform 0;
    }

    empty
    {
        type            empty;
    }
}



// ************************************************************************* //
